dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxEvadc_bf.h
/** \brief Mask for Ifx_EVADC_ACCEN0_Bits.EN20 */
#define IFX_EVADC_ACCEN0_EN20_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_ACCEN0_Bits.EN20 */
#define IFX_EVADC_ACCEN0_EN20_OFF (20u)

/** \brief Length for Ifx_EVADC_ACCEN0_Bits.EN21 */
#define IFX_EVADC_ACCEN0_EN21_LEN (1u)

/** \brief Mask for Ifx_EVADC_ACCEN0_Bits.EN21 */
#define IFX_EVADC_ACCEN0_EN21_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_ACCEN0_Bits.EN21 */
#define IFX_EVADC_ACCEN0_EN21_OFF (21u)

/** \brief Length for Ifx_EVADC_ACCEN0_Bits.EN22 */
#define IFX_EVADC_ACCEN0_EN22_LEN (1u)

/** \brief Mask for Ifx_EVADC_ACCEN0_Bits.EN22 */
#define IFX_EVADC_ACCEN0_EN22_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_ACCEN0_Bits.EN22 */
#define IFX_EVADC_ACCEN0_EN22_OFF (22u)

/** \brief Length for Ifx_EVADC_ACCEN0_Bits.EN23 */
#define IFX_EVADC_ACCEN0_EN23_LEN (1u)

/** \brief Mask for Ifx_EVADC_ACCEN0_Bits.EN23 */
#define IFX_EVADC_ACCEN0_EN23_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_ACCEN0_Bits.EN23 */
#define IFX_EVADC_ACCEN0_EN23_OFF (23u)

/** \brief Length for Ifx_EVADC_ACCEN0_Bits.EN24 */
#define IFX_EVADC_ACCEN0_EN24_LEN (1u)

/** \brief Mask for Ifx_EVADC_ACCEN0_Bits.EN24 */
#define IFX_EVADC_ACCEN0_EN24_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_ACCEN0_Bits.EN24 */
#define IFX_EVADC_ACCEN0_EN24_OFF (24u)

/** \brief Length for Ifx_EVADC_ACCEN0_Bits.EN25 */
#define IFX_EVADC_ACCEN0_EN25_LEN (1u)

/** \brief Mask for Ifx_EVADC_ACCEN0_Bits.EN25 */
#define IFX_EVADC_ACCEN0_EN25_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_ACCEN0_Bits.EN25 */
#define IFX_EVADC_ACCEN0_EN25_OFF (25u)

/** \brief Length for Ifx_EVADC_ACCEN0_Bits.EN26 */
#define IFX_EVADC_ACCEN0_EN26_LEN (1u)

/** \brief Mask for Ifx_EVADC_ACCEN0_Bits.EN26 */
#define IFX_EVADC_ACCEN0_EN26_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_ACCEN0_Bits.EN26 */
#define IFX_EVADC_ACCEN0_EN26_OFF (26u)

/** \brief Length for Ifx_EVADC_ACCEN0_Bits.EN27 */
#define IFX_EVADC_ACCEN0_EN27_LEN (1u)

/** \brief Mask for Ifx_EVADC_ACCEN0_Bits.EN27 */
#define IFX_EVADC_ACCEN0_EN27_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_ACCEN0_Bits.EN27 */
#define IFX_EVADC_ACCEN0_EN27_OFF (27u)

/** \brief Length for Ifx_EVADC_ACCEN0_Bits.EN28 */
#define IFX_EVADC_ACCEN0_EN28_LEN (1u)

/** \brief Mask for Ifx_EVADC_ACCEN0_Bits.EN28 */
#define IFX_EVADC_ACCEN0_EN28_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_ACCEN0_Bits.EN28 */
#define IFX_EVADC_ACCEN0_EN28_OFF (28u)

/** \brief Length for Ifx_EVADC_ACCEN0_Bits.EN29 */
#define IFX_EVADC_ACCEN0_EN29_LEN (1u)

/** \brief Mask for Ifx_EVADC_ACCEN0_Bits.EN29 */
#define IFX_EVADC_ACCEN0_EN29_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_ACCEN0_Bits.EN29 */
#define IFX_EVADC_ACCEN0_EN29_OFF (29u)

/** \brief Length for Ifx_EVADC_ACCEN0_Bits.EN30 */
#define IFX_EVADC_ACCEN0_EN30_LEN (1u)

/** \brief Mask for Ifx_EVADC_ACCEN0_Bits.EN30 */
#define IFX_EVADC_ACCEN0_EN30_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_ACCEN0_Bits.EN30 */
#define IFX_EVADC_ACCEN0_EN30_OFF (30u)

/** \brief Length for Ifx_EVADC_ACCEN0_Bits.EN31 */
#define IFX_EVADC_ACCEN0_EN31_LEN (1u)

/** \brief Mask for Ifx_EVADC_ACCEN0_Bits.EN31 */
#define IFX_EVADC_ACCEN0_EN31_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_ACCEN0_Bits.EN31 */
#define IFX_EVADC_ACCEN0_EN31_OFF (31u)

/** \brief Length for Ifx_EVADC_GLOBCFG_Bits.USC */
#define IFX_EVADC_GLOBCFG_USC_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOBCFG_Bits.USC */
#define IFX_EVADC_GLOBCFG_USC_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOBCFG_Bits.USC */
#define IFX_EVADC_GLOBCFG_USC_OFF (12u)

/** \brief Length for Ifx_EVADC_GLOBCFG_Bits.SUPLEV */
#define IFX_EVADC_GLOBCFG_SUPLEV_LEN (2u)

/** \brief Mask for Ifx_EVADC_GLOBCFG_Bits.SUPLEV */
#define IFX_EVADC_GLOBCFG_SUPLEV_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_GLOBCFG_Bits.SUPLEV */
#define IFX_EVADC_GLOBCFG_SUPLEV_OFF (13u)

/** \brief Length for Ifx_EVADC_GLOBCFG_Bits.CPWC */
#define IFX_EVADC_GLOBCFG_CPWC_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOBCFG_Bits.CPWC */
#define IFX_EVADC_GLOBCFG_CPWC_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOBCFG_Bits.CPWC */
#define IFX_EVADC_GLOBCFG_CPWC_OFF (15u)

/** \brief Length for Ifx_EVADC_GLOBCFG_Bits.SUCAL */
#define IFX_EVADC_GLOBCFG_SUCAL_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOBCFG_Bits.SUCAL */
#define IFX_EVADC_GLOBCFG_SUCAL_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOBCFG_Bits.SUCAL */
#define IFX_EVADC_GLOBCFG_SUCAL_OFF (31u)

/** \brief Length for Ifx_EVADC_ACCPROT0_Bits.APCP */
#define IFX_EVADC_ACCPROT0_APCP_LEN (2u)

/** \brief Mask for Ifx_EVADC_ACCPROT0_Bits.APCP */
#define IFX_EVADC_ACCPROT0_APCP_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_ACCPROT0_Bits.APCP */
#define IFX_EVADC_ACCPROT0_APCP_OFF (0u)

/** \brief Length for Ifx_EVADC_ACCPROT0_Bits.APIP */
#define IFX_EVADC_ACCPROT0_APIP_LEN (2u)

/** \brief Mask for Ifx_EVADC_ACCPROT0_Bits.APIP */
#define IFX_EVADC_ACCPROT0_APIP_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_ACCPROT0_Bits.APIP */
#define IFX_EVADC_ACCPROT0_APIP_OFF (16u)

/** \brief Length for Ifx_EVADC_ACCPROT1_Bits.APSP */
#define IFX_EVADC_ACCPROT1_APSP_LEN (2u)

/** \brief Mask for Ifx_EVADC_ACCPROT1_Bits.APSP */
#define IFX_EVADC_ACCPROT1_APSP_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_ACCPROT1_Bits.APSP */
#define IFX_EVADC_ACCPROT1_APSP_OFF (0u)

/** \brief Length for Ifx_EVADC_ACCPROT1_Bits.APRP */
#define IFX_EVADC_ACCPROT1_APRP_LEN (2u)

/** \brief Mask for Ifx_EVADC_ACCPROT1_Bits.APRP */
#define IFX_EVADC_ACCPROT1_APRP_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_ACCPROT1_Bits.APRP */
#define IFX_EVADC_ACCPROT1_APRP_OFF (16u)

/** \brief Length for Ifx_EVADC_ACCPROT2_Bits.APGC */
#define IFX_EVADC_ACCPROT2_APGC_LEN (1u)

/** \brief Mask for Ifx_EVADC_ACCPROT2_Bits.APGC */
#define IFX_EVADC_ACCPROT2_APGC_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_ACCPROT2_Bits.APGC */
#define IFX_EVADC_ACCPROT2_APGC_OFF (16u)

/** \brief Length for Ifx_EVADC_ACCPROT2_Bits.APEM */
#define IFX_EVADC_ACCPROT2_APEM_LEN (1u)

/** \brief Mask for Ifx_EVADC_ACCPROT2_Bits.APEM */
#define IFX_EVADC_ACCPROT2_APEM_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_ACCPROT2_Bits.APEM */
#define IFX_EVADC_ACCPROT2_APEM_OFF (17u)

