dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxEvadc_bf.h
/** \brief Length for Ifx_EVADC_ACCPROT2_Bits.APTF */
#define IFX_EVADC_ACCPROT2_APTF_LEN (1u)

/** \brief Mask for Ifx_EVADC_ACCPROT2_Bits.APTF */
#define IFX_EVADC_ACCPROT2_APTF_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_ACCPROT2_Bits.APTF */
#define IFX_EVADC_ACCPROT2_APTF_OFF (18u)

/** \brief Length for Ifx_EVADC_GLOB_ICLASS_Bits.STCS */
#define IFX_EVADC_GLOB_ICLASS_STCS_LEN (5u)

/** \brief Mask for Ifx_EVADC_GLOB_ICLASS_Bits.STCS */
#define IFX_EVADC_GLOB_ICLASS_STCS_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_GLOB_ICLASS_Bits.STCS */
#define IFX_EVADC_GLOB_ICLASS_STCS_OFF (0u)

/** \brief Length for Ifx_EVADC_GLOB_ICLASS_Bits.AIPS */
#define IFX_EVADC_GLOB_ICLASS_AIPS_LEN (2u)

/** \brief Mask for Ifx_EVADC_GLOB_ICLASS_Bits.AIPS */
#define IFX_EVADC_GLOB_ICLASS_AIPS_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_GLOB_ICLASS_Bits.AIPS */
#define IFX_EVADC_GLOB_ICLASS_AIPS_OFF (6u)

/** \brief Length for Ifx_EVADC_GLOB_ICLASS_Bits.CMS */
#define IFX_EVADC_GLOB_ICLASS_CMS_LEN (2u)

/** \brief Mask for Ifx_EVADC_GLOB_ICLASS_Bits.CMS */
#define IFX_EVADC_GLOB_ICLASS_CMS_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_GLOB_ICLASS_Bits.CMS */
#define IFX_EVADC_GLOB_ICLASS_CMS_OFF (8u)

/** \brief Length for Ifx_EVADC_GLOB_ICLASS_Bits.SESPS */
#define IFX_EVADC_GLOB_ICLASS_SESPS_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_ICLASS_Bits.SESPS */
#define IFX_EVADC_GLOB_ICLASS_SESPS_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_ICLASS_Bits.SESPS */
#define IFX_EVADC_GLOB_ICLASS_SESPS_OFF (10u)

/** \brief Length for Ifx_EVADC_GLOB_ICLASS_Bits.STCE */
#define IFX_EVADC_GLOB_ICLASS_STCE_LEN (5u)

/** \brief Mask for Ifx_EVADC_GLOB_ICLASS_Bits.STCE */
#define IFX_EVADC_GLOB_ICLASS_STCE_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_GLOB_ICLASS_Bits.STCE */
#define IFX_EVADC_GLOB_ICLASS_STCE_OFF (16u)

/** \brief Length for Ifx_EVADC_GLOB_ICLASS_Bits.AIPE */
#define IFX_EVADC_GLOB_ICLASS_AIPE_LEN (2u)

/** \brief Mask for Ifx_EVADC_GLOB_ICLASS_Bits.AIPE */
#define IFX_EVADC_GLOB_ICLASS_AIPE_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_GLOB_ICLASS_Bits.AIPE */
#define IFX_EVADC_GLOB_ICLASS_AIPE_OFF (22u)

/** \brief Length for Ifx_EVADC_GLOB_ICLASS_Bits.CME */
#define IFX_EVADC_GLOB_ICLASS_CME_LEN (2u)

/** \brief Mask for Ifx_EVADC_GLOB_ICLASS_Bits.CME */
#define IFX_EVADC_GLOB_ICLASS_CME_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_GLOB_ICLASS_Bits.CME */
#define IFX_EVADC_GLOB_ICLASS_CME_OFF (24u)

/** \brief Length for Ifx_EVADC_GLOB_ICLASS_Bits.SESPE */
#define IFX_EVADC_GLOB_ICLASS_SESPE_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_ICLASS_Bits.SESPE */
#define IFX_EVADC_GLOB_ICLASS_SESPE_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_ICLASS_Bits.SESPE */
#define IFX_EVADC_GLOB_ICLASS_SESPE_OFF (26u)

/** \brief Length for Ifx_EVADC_GLOB_BOUND_Bits.BOUNDARY0 */
#define IFX_EVADC_GLOB_BOUND_BOUNDARY0_LEN (12u)

/** \brief Mask for Ifx_EVADC_GLOB_BOUND_Bits.BOUNDARY0 */
#define IFX_EVADC_GLOB_BOUND_BOUNDARY0_MSK (0xfffu)

/** \brief Offset for Ifx_EVADC_GLOB_BOUND_Bits.BOUNDARY0 */
#define IFX_EVADC_GLOB_BOUND_BOUNDARY0_OFF (0u)

/** \brief Length for Ifx_EVADC_GLOB_BOUND_Bits.BOUNDARY1 */
#define IFX_EVADC_GLOB_BOUND_BOUNDARY1_LEN (12u)

/** \brief Mask for Ifx_EVADC_GLOB_BOUND_Bits.BOUNDARY1 */
#define IFX_EVADC_GLOB_BOUND_BOUNDARY1_MSK (0xfffu)

/** \brief Offset for Ifx_EVADC_GLOB_BOUND_Bits.BOUNDARY1 */
#define IFX_EVADC_GLOB_BOUND_BOUNDARY1_OFF (16u)

/** \brief Length for Ifx_EVADC_GLOB_EFLAG_Bits.REVGLB */
#define IFX_EVADC_GLOB_EFLAG_REVGLB_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_EFLAG_Bits.REVGLB */
#define IFX_EVADC_GLOB_EFLAG_REVGLB_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_EFLAG_Bits.REVGLB */
#define IFX_EVADC_GLOB_EFLAG_REVGLB_OFF (8u)

/** \brief Length for Ifx_EVADC_GLOB_EFLAG_Bits.REVGLBCLR */
#define IFX_EVADC_GLOB_EFLAG_REVGLBCLR_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_EFLAG_Bits.REVGLBCLR */
#define IFX_EVADC_GLOB_EFLAG_REVGLBCLR_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_EFLAG_Bits.REVGLBCLR */
#define IFX_EVADC_GLOB_EFLAG_REVGLBCLR_OFF (24u)

/** \brief Length for Ifx_EVADC_GLOB_EVNP_Bits.REV0NP */
#define IFX_EVADC_GLOB_EVNP_REV0NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_GLOB_EVNP_Bits.REV0NP */
#define IFX_EVADC_GLOB_EVNP_REV0NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_GLOB_EVNP_Bits.REV0NP */
#define IFX_EVADC_GLOB_EVNP_REV0NP_OFF (16u)

/** \brief Length for Ifx_EVADC_GLOB_TF_Bits.CDCH */
#define IFX_EVADC_GLOB_TF_CDCH_LEN (4u)

/** \brief Mask for Ifx_EVADC_GLOB_TF_Bits.CDCH */
#define IFX_EVADC_GLOB_TF_CDCH_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_GLOB_TF_Bits.CDCH */
#define IFX_EVADC_GLOB_TF_CDCH_OFF (0u)

/** \brief Length for Ifx_EVADC_GLOB_TF_Bits.CDGR */
#define IFX_EVADC_GLOB_TF_CDGR_LEN (4u)

/** \brief Mask for Ifx_EVADC_GLOB_TF_Bits.CDGR */
#define IFX_EVADC_GLOB_TF_CDGR_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_GLOB_TF_Bits.CDGR */
#define IFX_EVADC_GLOB_TF_CDGR_OFF (4u)

/** \brief Length for Ifx_EVADC_GLOB_TF_Bits.CDEN */
#define IFX_EVADC_GLOB_TF_CDEN_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_TF_Bits.CDEN */
#define IFX_EVADC_GLOB_TF_CDEN_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_TF_Bits.CDEN */
#define IFX_EVADC_GLOB_TF_CDEN_OFF (8u)

/** \brief Length for Ifx_EVADC_GLOB_TF_Bits.CDSEL */
#define IFX_EVADC_GLOB_TF_CDSEL_LEN (2u)

/** \brief Mask for Ifx_EVADC_GLOB_TF_Bits.CDSEL */
#define IFX_EVADC_GLOB_TF_CDSEL_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_GLOB_TF_Bits.CDSEL */
#define IFX_EVADC_GLOB_TF_CDSEL_OFF (9u)

/** \brief Length for Ifx_EVADC_GLOB_TF_Bits.CDWC */
#define IFX_EVADC_GLOB_TF_CDWC_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_TF_Bits.CDWC */
#define IFX_EVADC_GLOB_TF_CDWC_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_TF_Bits.CDWC */
#define IFX_EVADC_GLOB_TF_CDWC_OFF (15u)

/** \brief Length for Ifx_EVADC_GLOB_TF_Bits.PDD */
#define IFX_EVADC_GLOB_TF_PDD_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_TF_Bits.PDD */
#define IFX_EVADC_GLOB_TF_PDD_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_TF_Bits.PDD */
#define IFX_EVADC_GLOB_TF_PDD_OFF (16u)

