dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxEvadc_bf.h
/** \brief Offset for Ifx_EVADC_G_ARBPR_Bits.ASEN0 */
#define IFX_EVADC_G_ARBPR_ASEN0_OFF (24u)

/** \brief Length for Ifx_EVADC_G_ARBPR_Bits.ASEN1 */
#define IFX_EVADC_G_ARBPR_ASEN1_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ARBPR_Bits.ASEN1 */
#define IFX_EVADC_G_ARBPR_ASEN1_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ARBPR_Bits.ASEN1 */
#define IFX_EVADC_G_ARBPR_ASEN1_OFF (25u)

/** \brief Length for Ifx_EVADC_G_ARBPR_Bits.ASEN2 */
#define IFX_EVADC_G_ARBPR_ASEN2_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ARBPR_Bits.ASEN2 */
#define IFX_EVADC_G_ARBPR_ASEN2_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ARBPR_Bits.ASEN2 */
#define IFX_EVADC_G_ARBPR_ASEN2_OFF (26u)

/** \brief Length for Ifx_EVADC_G_ANCFG_Bits.IPE */
#define IFX_EVADC_G_ANCFG_IPE_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ANCFG_Bits.IPE */
#define IFX_EVADC_G_ANCFG_IPE_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ANCFG_Bits.IPE */
#define IFX_EVADC_G_ANCFG_IPE_OFF (0u)

/** \brief Length for Ifx_EVADC_G_ANCFG_Bits.BE */
#define IFX_EVADC_G_ANCFG_BE_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ANCFG_Bits.BE */
#define IFX_EVADC_G_ANCFG_BE_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ANCFG_Bits.BE */
#define IFX_EVADC_G_ANCFG_BE_OFF (1u)

/** \brief Length for Ifx_EVADC_G_ANCFG_Bits.RPE */
#define IFX_EVADC_G_ANCFG_RPE_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ANCFG_Bits.RPE */
#define IFX_EVADC_G_ANCFG_RPE_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ANCFG_Bits.RPE */
#define IFX_EVADC_G_ANCFG_RPE_OFF (2u)

/** \brief Length for Ifx_EVADC_G_ANCFG_Bits.RPC */
#define IFX_EVADC_G_ANCFG_RPC_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ANCFG_Bits.RPC */
#define IFX_EVADC_G_ANCFG_RPC_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ANCFG_Bits.RPC */
#define IFX_EVADC_G_ANCFG_RPC_OFF (3u)

/** \brief Length for Ifx_EVADC_G_ANCFG_Bits.CALSTC */
#define IFX_EVADC_G_ANCFG_CALSTC_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_ANCFG_Bits.CALSTC */
#define IFX_EVADC_G_ANCFG_CALSTC_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_ANCFG_Bits.CALSTC */
#define IFX_EVADC_G_ANCFG_CALSTC_OFF (4u)

/** \brief Length for Ifx_EVADC_G_ANCFG_Bits.DPCAL */
#define IFX_EVADC_G_ANCFG_DPCAL_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ANCFG_Bits.DPCAL */
#define IFX_EVADC_G_ANCFG_DPCAL_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ANCFG_Bits.DPCAL */
#define IFX_EVADC_G_ANCFG_DPCAL_OFF (6u)

/** \brief Length for Ifx_EVADC_G_ANCFG_Bits.ACSD */
#define IFX_EVADC_G_ANCFG_ACSD_LEN (3u)

/** \brief Mask for Ifx_EVADC_G_ANCFG_Bits.ACSD */
#define IFX_EVADC_G_ANCFG_ACSD_MSK (0x7u)

/** \brief Offset for Ifx_EVADC_G_ANCFG_Bits.ACSD */
#define IFX_EVADC_G_ANCFG_ACSD_OFF (16u)

/** \brief Length for Ifx_EVADC_G_ANCFG_Bits.SSE */
#define IFX_EVADC_G_ANCFG_SSE_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ANCFG_Bits.SSE */
#define IFX_EVADC_G_ANCFG_SSE_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ANCFG_Bits.SSE */
#define IFX_EVADC_G_ANCFG_SSE_OFF (19u)

/** \brief Length for Ifx_EVADC_G_ANCFG_Bits.DIVA */
#define IFX_EVADC_G_ANCFG_DIVA_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_ANCFG_Bits.DIVA */
#define IFX_EVADC_G_ANCFG_DIVA_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_ANCFG_Bits.DIVA */
#define IFX_EVADC_G_ANCFG_DIVA_OFF (20u)

/** \brief Length for Ifx_EVADC_G_ANCFG_Bits.DCMSB */
#define IFX_EVADC_G_ANCFG_DCMSB_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ANCFG_Bits.DCMSB */
#define IFX_EVADC_G_ANCFG_DCMSB_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ANCFG_Bits.DCMSB */
#define IFX_EVADC_G_ANCFG_DCMSB_OFF (25u)

/** \brief Length for Ifx_EVADC_G_ICLASS_Bits.STCS */
#define IFX_EVADC_G_ICLASS_STCS_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_ICLASS_Bits.STCS */
#define IFX_EVADC_G_ICLASS_STCS_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_ICLASS_Bits.STCS */
#define IFX_EVADC_G_ICLASS_STCS_OFF (0u)

/** \brief Length for Ifx_EVADC_G_ICLASS_Bits.AIPS */
#define IFX_EVADC_G_ICLASS_AIPS_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_ICLASS_Bits.AIPS */
#define IFX_EVADC_G_ICLASS_AIPS_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_ICLASS_Bits.AIPS */
#define IFX_EVADC_G_ICLASS_AIPS_OFF (6u)

/** \brief Length for Ifx_EVADC_G_ICLASS_Bits.CMS */
#define IFX_EVADC_G_ICLASS_CMS_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_ICLASS_Bits.CMS */
#define IFX_EVADC_G_ICLASS_CMS_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_ICLASS_Bits.CMS */
#define IFX_EVADC_G_ICLASS_CMS_OFF (8u)

/** \brief Length for Ifx_EVADC_G_ICLASS_Bits.SESPS */
#define IFX_EVADC_G_ICLASS_SESPS_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ICLASS_Bits.SESPS */
#define IFX_EVADC_G_ICLASS_SESPS_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ICLASS_Bits.SESPS */
#define IFX_EVADC_G_ICLASS_SESPS_OFF (10u)

/** \brief Length for Ifx_EVADC_G_ICLASS_Bits.STCE */
#define IFX_EVADC_G_ICLASS_STCE_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_ICLASS_Bits.STCE */
#define IFX_EVADC_G_ICLASS_STCE_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_ICLASS_Bits.STCE */
#define IFX_EVADC_G_ICLASS_STCE_OFF (16u)

/** \brief Length for Ifx_EVADC_G_ICLASS_Bits.AIPE */
#define IFX_EVADC_G_ICLASS_AIPE_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_ICLASS_Bits.AIPE */
#define IFX_EVADC_G_ICLASS_AIPE_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_ICLASS_Bits.AIPE */
#define IFX_EVADC_G_ICLASS_AIPE_OFF (22u)

/** \brief Length for Ifx_EVADC_G_ICLASS_Bits.CME */
#define IFX_EVADC_G_ICLASS_CME_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_ICLASS_Bits.CME */
#define IFX_EVADC_G_ICLASS_CME_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_ICLASS_Bits.CME */
#define IFX_EVADC_G_ICLASS_CME_OFF (24u)

/** \brief Length for Ifx_EVADC_G_ICLASS_Bits.SESPE */
#define IFX_EVADC_G_ICLASS_SESPE_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ICLASS_Bits.SESPE */
#define IFX_EVADC_G_ICLASS_SESPE_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ICLASS_Bits.SESPE */
#define IFX_EVADC_G_ICLASS_SESPE_OFF (26u)

/** \brief Length for Ifx_EVADC_G_ALIAS_Bits.ALIAS0 */
#define IFX_EVADC_G_ALIAS_ALIAS0_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_ALIAS_Bits.ALIAS0 */
#define IFX_EVADC_G_ALIAS_ALIAS0_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_ALIAS_Bits.ALIAS0 */
#define IFX_EVADC_G_ALIAS_ALIAS0_OFF (0u)

/** \brief Length for Ifx_EVADC_G_ALIAS_Bits.ALIAS1 */
#define IFX_EVADC_G_ALIAS_ALIAS1_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_ALIAS_Bits.ALIAS1 */
#define IFX_EVADC_G_ALIAS_ALIAS1_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_ALIAS_Bits.ALIAS1 */
#define IFX_EVADC_G_ALIAS_ALIAS1_OFF (8u)

/** \brief Length for Ifx_EVADC_G_BOUND_Bits.BOUNDARY0 */
#define IFX_EVADC_G_BOUND_BOUNDARY0_LEN (12u)

/** \brief Mask for Ifx_EVADC_G_BOUND_Bits.BOUNDARY0 */
#define IFX_EVADC_G_BOUND_BOUNDARY0_MSK (0xfffu)

/** \brief Offset for Ifx_EVADC_G_BOUND_Bits.BOUNDARY0 */
#define IFX_EVADC_G_BOUND_BOUNDARY0_OFF (0u)

/** \brief Length for Ifx_EVADC_G_BOUND_Bits.BOUNDARY1 */
#define IFX_EVADC_G_BOUND_BOUNDARY1_LEN (12u)

