dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxEvadc_bf.h
/** \brief Length for Ifx_EVADC_G_Q_QMR_Bits.CEV */
#define IFX_EVADC_G_Q_QMR_CEV_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QMR_Bits.CEV */
#define IFX_EVADC_G_Q_QMR_CEV_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QMR_Bits.CEV */
#define IFX_EVADC_G_Q_QMR_CEV_OFF (11u)

/** \brief Length for Ifx_EVADC_G_Q_QMR_Bits.RPTDIS */
#define IFX_EVADC_G_Q_QMR_RPTDIS_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QMR_Bits.RPTDIS */
#define IFX_EVADC_G_Q_QMR_RPTDIS_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QMR_Bits.RPTDIS */
#define IFX_EVADC_G_Q_QMR_RPTDIS_OFF (16u)

/** \brief Length for Ifx_EVADC_G_Q_QSR_Bits.FILL */
#define IFX_EVADC_G_Q_QSR_FILL_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_Q_QSR_Bits.FILL */
#define IFX_EVADC_G_Q_QSR_FILL_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_Q_QSR_Bits.FILL */
#define IFX_EVADC_G_Q_QSR_FILL_OFF (0u)

/** \brief Length for Ifx_EVADC_G_Q_QSR_Bits.EMPTY */
#define IFX_EVADC_G_Q_QSR_EMPTY_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QSR_Bits.EMPTY */
#define IFX_EVADC_G_Q_QSR_EMPTY_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QSR_Bits.EMPTY */
#define IFX_EVADC_G_Q_QSR_EMPTY_OFF (5u)

/** \brief Length for Ifx_EVADC_G_Q_QSR_Bits.REQGT */
#define IFX_EVADC_G_Q_QSR_REQGT_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QSR_Bits.REQGT */
#define IFX_EVADC_G_Q_QSR_REQGT_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QSR_Bits.REQGT */
#define IFX_EVADC_G_Q_QSR_REQGT_OFF (7u)

/** \brief Length for Ifx_EVADC_G_Q_QSR_Bits.EV */
#define IFX_EVADC_G_Q_QSR_EV_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QSR_Bits.EV */
#define IFX_EVADC_G_Q_QSR_EV_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QSR_Bits.EV */
#define IFX_EVADC_G_Q_QSR_EV_OFF (8u)

/** \brief Length for Ifx_EVADC_G_Q_Q0R_Bits.REQCHNR */
#define IFX_EVADC_G_Q_Q0R_REQCHNR_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_Q_Q0R_Bits.REQCHNR */
#define IFX_EVADC_G_Q_Q0R_REQCHNR_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_Q_Q0R_Bits.REQCHNR */
#define IFX_EVADC_G_Q_Q0R_REQCHNR_OFF (0u)

/** \brief Length for Ifx_EVADC_G_Q_Q0R_Bits.RF */
#define IFX_EVADC_G_Q_Q0R_RF_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_Q0R_Bits.RF */
#define IFX_EVADC_G_Q_Q0R_RF_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_Q0R_Bits.RF */
#define IFX_EVADC_G_Q_Q0R_RF_OFF (5u)

/** \brief Length for Ifx_EVADC_G_Q_Q0R_Bits.ENSI */
#define IFX_EVADC_G_Q_Q0R_ENSI_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_Q0R_Bits.ENSI */
#define IFX_EVADC_G_Q_Q0R_ENSI_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_Q0R_Bits.ENSI */
#define IFX_EVADC_G_Q_Q0R_ENSI_OFF (6u)

/** \brief Length for Ifx_EVADC_G_Q_Q0R_Bits.EXTR */
#define IFX_EVADC_G_Q_Q0R_EXTR_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_Q0R_Bits.EXTR */
#define IFX_EVADC_G_Q_Q0R_EXTR_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_Q0R_Bits.EXTR */
#define IFX_EVADC_G_Q_Q0R_EXTR_OFF (7u)

/** \brief Length for Ifx_EVADC_G_Q_Q0R_Bits.V */
#define IFX_EVADC_G_Q_Q0R_V_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_Q0R_Bits.V */
#define IFX_EVADC_G_Q_Q0R_V_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_Q0R_Bits.V */
#define IFX_EVADC_G_Q_Q0R_V_OFF (8u)

/** \brief Length for Ifx_EVADC_G_Q_Q0R_Bits.PDD */
#define IFX_EVADC_G_Q_Q0R_PDD_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_Q0R_Bits.PDD */
#define IFX_EVADC_G_Q_Q0R_PDD_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_Q0R_Bits.PDD */
#define IFX_EVADC_G_Q_Q0R_PDD_OFF (9u)

/** \brief Length for Ifx_EVADC_G_Q_Q0R_Bits.MDPD */
#define IFX_EVADC_G_Q_Q0R_MDPD_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_Q0R_Bits.MDPD */
#define IFX_EVADC_G_Q_Q0R_MDPD_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_Q0R_Bits.MDPD */
#define IFX_EVADC_G_Q_Q0R_MDPD_OFF (10u)

/** \brief Length for Ifx_EVADC_G_Q_Q0R_Bits.MDPU */
#define IFX_EVADC_G_Q_Q0R_MDPU_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_Q0R_Bits.MDPU */
#define IFX_EVADC_G_Q_Q0R_MDPU_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_Q0R_Bits.MDPU */
#define IFX_EVADC_G_Q_Q0R_MDPU_OFF (11u)

/** \brief Length for Ifx_EVADC_G_Q_Q0R_Bits.CDEN */
#define IFX_EVADC_G_Q_Q0R_CDEN_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_Q0R_Bits.CDEN */
#define IFX_EVADC_G_Q_Q0R_CDEN_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_Q0R_Bits.CDEN */
#define IFX_EVADC_G_Q_Q0R_CDEN_OFF (12u)

/** \brief Length for Ifx_EVADC_G_Q_Q0R_Bits.CDSEL */
#define IFX_EVADC_G_Q_Q0R_CDSEL_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_Q_Q0R_Bits.CDSEL */
#define IFX_EVADC_G_Q_Q0R_CDSEL_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_Q_Q0R_Bits.CDSEL */
#define IFX_EVADC_G_Q_Q0R_CDSEL_OFF (13u)

/** \brief Length for Ifx_EVADC_G_Q_QINR_Bits.REQCHNR */
#define IFX_EVADC_G_Q_QINR_REQCHNR_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_Q_QINR_Bits.REQCHNR */
#define IFX_EVADC_G_Q_QINR_REQCHNR_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_Q_QINR_Bits.REQCHNR */
#define IFX_EVADC_G_Q_QINR_REQCHNR_OFF (0u)

/** \brief Length for Ifx_EVADC_G_Q_QINR_Bits.RF */
#define IFX_EVADC_G_Q_QINR_RF_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QINR_Bits.RF */
#define IFX_EVADC_G_Q_QINR_RF_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QINR_Bits.RF */
#define IFX_EVADC_G_Q_QINR_RF_OFF (5u)

/** \brief Length for Ifx_EVADC_G_Q_QINR_Bits.ENSI */
#define IFX_EVADC_G_Q_QINR_ENSI_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QINR_Bits.ENSI */
#define IFX_EVADC_G_Q_QINR_ENSI_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QINR_Bits.ENSI */
#define IFX_EVADC_G_Q_QINR_ENSI_OFF (6u)

/** \brief Length for Ifx_EVADC_G_Q_QINR_Bits.EXTR */
#define IFX_EVADC_G_Q_QINR_EXTR_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QINR_Bits.EXTR */
#define IFX_EVADC_G_Q_QINR_EXTR_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QINR_Bits.EXTR */
#define IFX_EVADC_G_Q_QINR_EXTR_OFF (7u)

/** \brief Length for Ifx_EVADC_G_Q_QINR_Bits.PDD */
#define IFX_EVADC_G_Q_QINR_PDD_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QINR_Bits.PDD */
#define IFX_EVADC_G_Q_QINR_PDD_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QINR_Bits.PDD */
#define IFX_EVADC_G_Q_QINR_PDD_OFF (9u)

/** \brief Length for Ifx_EVADC_G_Q_QINR_Bits.MDPD */
#define IFX_EVADC_G_Q_QINR_MDPD_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QINR_Bits.MDPD */
#define IFX_EVADC_G_Q_QINR_MDPD_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QINR_Bits.MDPD */
#define IFX_EVADC_G_Q_QINR_MDPD_OFF (10u)

/** \brief Length for Ifx_EVADC_G_Q_QINR_Bits.MDPU */
#define IFX_EVADC_G_Q_QINR_MDPU_LEN (1u)

