dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxEvadc_bf.h
/** \brief Length for Ifx_EVADC_G_REFLAG_Bits.REV9 */
#define IFX_EVADC_G_REFLAG_REV9_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFLAG_Bits.REV9 */
#define IFX_EVADC_G_REFLAG_REV9_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_REFLAG_Bits.REV9 */
#define IFX_EVADC_G_REFLAG_REV9_OFF (9u)

/** \brief Length for Ifx_EVADC_G_REFLAG_Bits.REV10 */
#define IFX_EVADC_G_REFLAG_REV10_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFLAG_Bits.REV10 */
#define IFX_EVADC_G_REFLAG_REV10_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_REFLAG_Bits.REV10 */
#define IFX_EVADC_G_REFLAG_REV10_OFF (10u)

/** \brief Length for Ifx_EVADC_G_REFLAG_Bits.REV11 */
#define IFX_EVADC_G_REFLAG_REV11_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFLAG_Bits.REV11 */
#define IFX_EVADC_G_REFLAG_REV11_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_REFLAG_Bits.REV11 */
#define IFX_EVADC_G_REFLAG_REV11_OFF (11u)

/** \brief Length for Ifx_EVADC_G_REFLAG_Bits.REV12 */
#define IFX_EVADC_G_REFLAG_REV12_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFLAG_Bits.REV12 */
#define IFX_EVADC_G_REFLAG_REV12_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_REFLAG_Bits.REV12 */
#define IFX_EVADC_G_REFLAG_REV12_OFF (12u)

/** \brief Length for Ifx_EVADC_G_REFLAG_Bits.REV13 */
#define IFX_EVADC_G_REFLAG_REV13_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFLAG_Bits.REV13 */
#define IFX_EVADC_G_REFLAG_REV13_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_REFLAG_Bits.REV13 */
#define IFX_EVADC_G_REFLAG_REV13_OFF (13u)

/** \brief Length for Ifx_EVADC_G_REFLAG_Bits.REV14 */
#define IFX_EVADC_G_REFLAG_REV14_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFLAG_Bits.REV14 */
#define IFX_EVADC_G_REFLAG_REV14_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_REFLAG_Bits.REV14 */
#define IFX_EVADC_G_REFLAG_REV14_OFF (14u)

/** \brief Length for Ifx_EVADC_G_REFLAG_Bits.REV15 */
#define IFX_EVADC_G_REFLAG_REV15_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFLAG_Bits.REV15 */
#define IFX_EVADC_G_REFLAG_REV15_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_REFLAG_Bits.REV15 */
#define IFX_EVADC_G_REFLAG_REV15_OFF (15u)

/** \brief Length for Ifx_EVADC_G_SEFLAG_Bits.SEV0 */
#define IFX_EVADC_G_SEFLAG_SEV0_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SEFLAG_Bits.SEV0 */
#define IFX_EVADC_G_SEFLAG_SEV0_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SEFLAG_Bits.SEV0 */
#define IFX_EVADC_G_SEFLAG_SEV0_OFF (0u)

/** \brief Length for Ifx_EVADC_G_SEFLAG_Bits.SEV1 */
#define IFX_EVADC_G_SEFLAG_SEV1_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SEFLAG_Bits.SEV1 */
#define IFX_EVADC_G_SEFLAG_SEV1_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SEFLAG_Bits.SEV1 */
#define IFX_EVADC_G_SEFLAG_SEV1_OFF (1u)

/** \brief Length for Ifx_EVADC_G_SEFLAG_Bits.SEV2 */
#define IFX_EVADC_G_SEFLAG_SEV2_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SEFLAG_Bits.SEV2 */
#define IFX_EVADC_G_SEFLAG_SEV2_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SEFLAG_Bits.SEV2 */
#define IFX_EVADC_G_SEFLAG_SEV2_OFF (2u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV0 */
#define IFX_EVADC_G_CEFCLR_CEV0_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV0 */
#define IFX_EVADC_G_CEFCLR_CEV0_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV0 */
#define IFX_EVADC_G_CEFCLR_CEV0_OFF (0u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV1 */
#define IFX_EVADC_G_CEFCLR_CEV1_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV1 */
#define IFX_EVADC_G_CEFCLR_CEV1_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV1 */
#define IFX_EVADC_G_CEFCLR_CEV1_OFF (1u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV2 */
#define IFX_EVADC_G_CEFCLR_CEV2_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV2 */
#define IFX_EVADC_G_CEFCLR_CEV2_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV2 */
#define IFX_EVADC_G_CEFCLR_CEV2_OFF (2u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV3 */
#define IFX_EVADC_G_CEFCLR_CEV3_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV3 */
#define IFX_EVADC_G_CEFCLR_CEV3_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV3 */
#define IFX_EVADC_G_CEFCLR_CEV3_OFF (3u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV4 */
#define IFX_EVADC_G_CEFCLR_CEV4_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV4 */
#define IFX_EVADC_G_CEFCLR_CEV4_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV4 */
#define IFX_EVADC_G_CEFCLR_CEV4_OFF (4u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV5 */
#define IFX_EVADC_G_CEFCLR_CEV5_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV5 */
#define IFX_EVADC_G_CEFCLR_CEV5_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV5 */
#define IFX_EVADC_G_CEFCLR_CEV5_OFF (5u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV6 */
#define IFX_EVADC_G_CEFCLR_CEV6_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV6 */
#define IFX_EVADC_G_CEFCLR_CEV6_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV6 */
#define IFX_EVADC_G_CEFCLR_CEV6_OFF (6u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV7 */
#define IFX_EVADC_G_CEFCLR_CEV7_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV7 */
#define IFX_EVADC_G_CEFCLR_CEV7_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV7 */
#define IFX_EVADC_G_CEFCLR_CEV7_OFF (7u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV8 */
#define IFX_EVADC_G_CEFCLR_CEV8_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV8 */
#define IFX_EVADC_G_CEFCLR_CEV8_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV8 */
#define IFX_EVADC_G_CEFCLR_CEV8_OFF (8u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV9 */
#define IFX_EVADC_G_CEFCLR_CEV9_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV9 */
#define IFX_EVADC_G_CEFCLR_CEV9_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV9 */
#define IFX_EVADC_G_CEFCLR_CEV9_OFF (9u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV10 */
#define IFX_EVADC_G_CEFCLR_CEV10_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV10 */
#define IFX_EVADC_G_CEFCLR_CEV10_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV10 */
#define IFX_EVADC_G_CEFCLR_CEV10_OFF (10u)

