dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxEvadc_bf.h
/** \brief Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMXWC */
#define IFX_EVADC_G_EMUXCTR_EMXWC_OFF (15u)

/** \brief Length for Ifx_EVADC_G_EMUXCTR_Bits.EMUXACT */
#define IFX_EVADC_G_EMUXCTR_EMUXACT_LEN (3u)

/** \brief Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMUXACT */
#define IFX_EVADC_G_EMUXCTR_EMUXACT_MSK (0x7u)

/** \brief Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMUXACT */
#define IFX_EVADC_G_EMUXCTR_EMUXACT_OFF (16u)

/** \brief Length for Ifx_EVADC_G_EMUXCTR_Bits.EMUXCCB */
#define IFX_EVADC_G_EMUXCTR_EMUXCCB_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMUXCCB */
#define IFX_EVADC_G_EMUXCTR_EMUXCCB_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMUXCCB */
#define IFX_EVADC_G_EMUXCTR_EMUXCCB_OFF (20u)

/** \brief Length for Ifx_EVADC_G_EMUXCS_Bits.EMUXCH */
#define IFX_EVADC_G_EMUXCS_EMUXCH_LEN (16u)

/** \brief Mask for Ifx_EVADC_G_EMUXCS_Bits.EMUXCH */
#define IFX_EVADC_G_EMUXCS_EMUXCH_MSK (0xffffu)

/** \brief Offset for Ifx_EVADC_G_EMUXCS_Bits.EMUXCH */
#define IFX_EVADC_G_EMUXCS_EMUXCH_OFF (0u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF0 */
#define IFX_EVADC_G_VFR_VF0_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF0 */
#define IFX_EVADC_G_VFR_VF0_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF0 */
#define IFX_EVADC_G_VFR_VF0_OFF (0u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF1 */
#define IFX_EVADC_G_VFR_VF1_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF1 */
#define IFX_EVADC_G_VFR_VF1_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF1 */
#define IFX_EVADC_G_VFR_VF1_OFF (1u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF2 */
#define IFX_EVADC_G_VFR_VF2_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF2 */
#define IFX_EVADC_G_VFR_VF2_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF2 */
#define IFX_EVADC_G_VFR_VF2_OFF (2u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF3 */
#define IFX_EVADC_G_VFR_VF3_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF3 */
#define IFX_EVADC_G_VFR_VF3_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF3 */
#define IFX_EVADC_G_VFR_VF3_OFF (3u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF4 */
#define IFX_EVADC_G_VFR_VF4_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF4 */
#define IFX_EVADC_G_VFR_VF4_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF4 */
#define IFX_EVADC_G_VFR_VF4_OFF (4u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF5 */
#define IFX_EVADC_G_VFR_VF5_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF5 */
#define IFX_EVADC_G_VFR_VF5_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF5 */
#define IFX_EVADC_G_VFR_VF5_OFF (5u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF6 */
#define IFX_EVADC_G_VFR_VF6_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF6 */
#define IFX_EVADC_G_VFR_VF6_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF6 */
#define IFX_EVADC_G_VFR_VF6_OFF (6u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF7 */
#define IFX_EVADC_G_VFR_VF7_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF7 */
#define IFX_EVADC_G_VFR_VF7_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF7 */
#define IFX_EVADC_G_VFR_VF7_OFF (7u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF8 */
#define IFX_EVADC_G_VFR_VF8_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF8 */
#define IFX_EVADC_G_VFR_VF8_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF8 */
#define IFX_EVADC_G_VFR_VF8_OFF (8u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF9 */
#define IFX_EVADC_G_VFR_VF9_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF9 */
#define IFX_EVADC_G_VFR_VF9_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF9 */
#define IFX_EVADC_G_VFR_VF9_OFF (9u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF10 */
#define IFX_EVADC_G_VFR_VF10_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF10 */
#define IFX_EVADC_G_VFR_VF10_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF10 */
#define IFX_EVADC_G_VFR_VF10_OFF (10u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF11 */
#define IFX_EVADC_G_VFR_VF11_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF11 */
#define IFX_EVADC_G_VFR_VF11_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF11 */
#define IFX_EVADC_G_VFR_VF11_OFF (11u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF12 */
#define IFX_EVADC_G_VFR_VF12_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF12 */
#define IFX_EVADC_G_VFR_VF12_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF12 */
#define IFX_EVADC_G_VFR_VF12_OFF (12u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF13 */
#define IFX_EVADC_G_VFR_VF13_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF13 */
#define IFX_EVADC_G_VFR_VF13_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF13 */
#define IFX_EVADC_G_VFR_VF13_OFF (13u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF14 */
#define IFX_EVADC_G_VFR_VF14_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF14 */
#define IFX_EVADC_G_VFR_VF14_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF14 */
#define IFX_EVADC_G_VFR_VF14_OFF (14u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF15 */
#define IFX_EVADC_G_VFR_VF15_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF15 */
#define IFX_EVADC_G_VFR_VF15_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF15 */
#define IFX_EVADC_G_VFR_VF15_OFF (15u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.ICLSEL */
#define IFX_EVADC_G_CHCTR_ICLSEL_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.ICLSEL */
#define IFX_EVADC_G_CHCTR_ICLSEL_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.ICLSEL */
#define IFX_EVADC_G_CHCTR_ICLSEL_OFF (0u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.BNDSELL */
#define IFX_EVADC_G_CHCTR_BNDSELL_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.BNDSELL */
#define IFX_EVADC_G_CHCTR_BNDSELL_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.BNDSELL */
#define IFX_EVADC_G_CHCTR_BNDSELL_OFF (4u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.BNDSELU */
#define IFX_EVADC_G_CHCTR_BNDSELU_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.BNDSELU */
#define IFX_EVADC_G_CHCTR_BNDSELU_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.BNDSELU */
#define IFX_EVADC_G_CHCTR_BNDSELU_OFF (6u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.CHEVMODE */
#define IFX_EVADC_G_CHCTR_CHEVMODE_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.CHEVMODE */
#define IFX_EVADC_G_CHCTR_CHEVMODE_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.CHEVMODE */
#define IFX_EVADC_G_CHCTR_CHEVMODE_OFF (8u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.SYNC */
#define IFX_EVADC_G_CHCTR_SYNC_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.SYNC */
#define IFX_EVADC_G_CHCTR_SYNC_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.SYNC */
#define IFX_EVADC_G_CHCTR_SYNC_OFF (10u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.REFSEL */
#define IFX_EVADC_G_CHCTR_REFSEL_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.REFSEL */
#define IFX_EVADC_G_CHCTR_REFSEL_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.REFSEL */
#define IFX_EVADC_G_CHCTR_REFSEL_OFF (11u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.BNDSELX */
#define IFX_EVADC_G_CHCTR_BNDSELX_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.BNDSELX */
#define IFX_EVADC_G_CHCTR_BNDSELX_MSK (0xfu)

