dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxEvadc_bf.h
/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.BNDSELX */
#define IFX_EVADC_G_CHCTR_BNDSELX_OFF (12u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.RESREG */
#define IFX_EVADC_G_CHCTR_RESREG_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.RESREG */
#define IFX_EVADC_G_CHCTR_RESREG_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.RESREG */
#define IFX_EVADC_G_CHCTR_RESREG_OFF (16u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.RESTGT */
#define IFX_EVADC_G_CHCTR_RESTGT_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.RESTGT */
#define IFX_EVADC_G_CHCTR_RESTGT_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.RESTGT */
#define IFX_EVADC_G_CHCTR_RESTGT_OFF (20u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.RESPOS */
#define IFX_EVADC_G_CHCTR_RESPOS_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.RESPOS */
#define IFX_EVADC_G_CHCTR_RESPOS_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.RESPOS */
#define IFX_EVADC_G_CHCTR_RESPOS_OFF (21u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.BWDCH */
#define IFX_EVADC_G_CHCTR_BWDCH_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.BWDCH */
#define IFX_EVADC_G_CHCTR_BWDCH_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.BWDCH */
#define IFX_EVADC_G_CHCTR_BWDCH_OFF (28u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.BWDEN */
#define IFX_EVADC_G_CHCTR_BWDEN_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.BWDEN */
#define IFX_EVADC_G_CHCTR_BWDEN_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.BWDEN */
#define IFX_EVADC_G_CHCTR_BWDEN_OFF (30u)

/** \brief Length for Ifx_EVADC_G_RCR_Bits.DRCTR */
#define IFX_EVADC_G_RCR_DRCTR_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_RCR_Bits.DRCTR */
#define IFX_EVADC_G_RCR_DRCTR_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_RCR_Bits.DRCTR */
#define IFX_EVADC_G_RCR_DRCTR_OFF (16u)

/** \brief Length for Ifx_EVADC_G_RCR_Bits.DMM */
#define IFX_EVADC_G_RCR_DMM_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_RCR_Bits.DMM */
#define IFX_EVADC_G_RCR_DMM_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_RCR_Bits.DMM */
#define IFX_EVADC_G_RCR_DMM_OFF (20u)

/** \brief Length for Ifx_EVADC_G_RCR_Bits.WFR */
#define IFX_EVADC_G_RCR_WFR_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_RCR_Bits.WFR */
#define IFX_EVADC_G_RCR_WFR_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_RCR_Bits.WFR */
#define IFX_EVADC_G_RCR_WFR_OFF (24u)

/** \brief Length for Ifx_EVADC_G_RCR_Bits.FEN */
#define IFX_EVADC_G_RCR_FEN_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_RCR_Bits.FEN */
#define IFX_EVADC_G_RCR_FEN_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_RCR_Bits.FEN */
#define IFX_EVADC_G_RCR_FEN_OFF (25u)

/** \brief Length for Ifx_EVADC_G_RCR_Bits.SRGEN */
#define IFX_EVADC_G_RCR_SRGEN_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_RCR_Bits.SRGEN */
#define IFX_EVADC_G_RCR_SRGEN_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_RCR_Bits.SRGEN */
#define IFX_EVADC_G_RCR_SRGEN_OFF (31u)

/** \brief Length for Ifx_EVADC_G_RES_Bits.RESULT */
#define IFX_EVADC_G_RES_RESULT_LEN (16u)

/** \brief Mask for Ifx_EVADC_G_RES_Bits.RESULT */
#define IFX_EVADC_G_RES_RESULT_MSK (0xffffu)

/** \brief Offset for Ifx_EVADC_G_RES_Bits.RESULT */
#define IFX_EVADC_G_RES_RESULT_OFF (0u)

/** \brief Length for Ifx_EVADC_G_RES_Bits.DRC */
#define IFX_EVADC_G_RES_DRC_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_RES_Bits.DRC */
#define IFX_EVADC_G_RES_DRC_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_RES_Bits.DRC */
#define IFX_EVADC_G_RES_DRC_OFF (16u)

/** \brief Length for Ifx_EVADC_G_RES_Bits.CHNR */
#define IFX_EVADC_G_RES_CHNR_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_RES_Bits.CHNR */
#define IFX_EVADC_G_RES_CHNR_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_RES_Bits.CHNR */
#define IFX_EVADC_G_RES_CHNR_OFF (20u)

/** \brief Length for Ifx_EVADC_G_RES_Bits.EMUX */
#define IFX_EVADC_G_RES_EMUX_LEN (3u)

/** \brief Mask for Ifx_EVADC_G_RES_Bits.EMUX */
#define IFX_EVADC_G_RES_EMUX_MSK (0x7u)

/** \brief Offset for Ifx_EVADC_G_RES_Bits.EMUX */
#define IFX_EVADC_G_RES_EMUX_OFF (25u)

/** \brief Length for Ifx_EVADC_G_RES_Bits.CRS */
#define IFX_EVADC_G_RES_CRS_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_RES_Bits.CRS */
#define IFX_EVADC_G_RES_CRS_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_RES_Bits.CRS */
#define IFX_EVADC_G_RES_CRS_OFF (28u)

/** \brief Length for Ifx_EVADC_G_RES_Bits.VF */
#define IFX_EVADC_G_RES_VF_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_RES_Bits.VF */
#define IFX_EVADC_G_RES_VF_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_RES_Bits.VF */
#define IFX_EVADC_G_RES_VF_OFF (31u)

/** \brief Length for Ifx_EVADC_G_RESD_Bits.RESULT */
#define IFX_EVADC_G_RESD_RESULT_LEN (16u)

/** \brief Mask for Ifx_EVADC_G_RESD_Bits.RESULT */
#define IFX_EVADC_G_RESD_RESULT_MSK (0xffffu)

/** \brief Offset for Ifx_EVADC_G_RESD_Bits.RESULT */
#define IFX_EVADC_G_RESD_RESULT_OFF (0u)

/** \brief Length for Ifx_EVADC_G_RESD_Bits.DRC */
#define IFX_EVADC_G_RESD_DRC_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_RESD_Bits.DRC */
#define IFX_EVADC_G_RESD_DRC_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_RESD_Bits.DRC */
#define IFX_EVADC_G_RESD_DRC_OFF (16u)

/** \brief Length for Ifx_EVADC_G_RESD_Bits.CHNR */
#define IFX_EVADC_G_RESD_CHNR_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_RESD_Bits.CHNR */
#define IFX_EVADC_G_RESD_CHNR_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_RESD_Bits.CHNR */
#define IFX_EVADC_G_RESD_CHNR_OFF (20u)

/** \brief Length for Ifx_EVADC_G_RESD_Bits.EMUX */
#define IFX_EVADC_G_RESD_EMUX_LEN (3u)

/** \brief Mask for Ifx_EVADC_G_RESD_Bits.EMUX */
#define IFX_EVADC_G_RESD_EMUX_MSK (0x7u)

/** \brief Offset for Ifx_EVADC_G_RESD_Bits.EMUX */
#define IFX_EVADC_G_RESD_EMUX_OFF (25u)

/** \brief Length for Ifx_EVADC_G_RESD_Bits.CRS */
#define IFX_EVADC_G_RESD_CRS_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_RESD_Bits.CRS */
#define IFX_EVADC_G_RESD_CRS_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_RESD_Bits.CRS */
#define IFX_EVADC_G_RESD_CRS_OFF (28u)

/** \brief Length for Ifx_EVADC_G_RESD_Bits.VF */
#define IFX_EVADC_G_RESD_VF_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_RESD_Bits.VF */
#define IFX_EVADC_G_RESD_VF_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_RESD_Bits.VF */
#define IFX_EVADC_G_RESD_VF_OFF (31u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXEVADC_BF_H */
